[{"Heading ":"Tips For Inner Peace and How To Stay Present","Context":"If I can offer any other advice that might help: sometimes in some people's minds, ‘being present’ can start to turn into hard work, or is perceived as a necessity to reach some kind of goal. At the end of the day it is all about feeling more at ease and aligned with your power, so go easy on yourself with it all…","Content":"Hello everyone,Someone emailed me recently after ordering \"Undisturbed: A Guide To Emotional Wellness\" and \"Get Out Of The Cage: A Guide To Inner Freedom\".The books were still being dispatched, but she expressed that she was working on being present and having less resistance, and that sometimes she was struggling.The advice I offered might help some of you reading this, so I thought I would share it:\"If I can offer any other advice that might help: sometimes in some people's minds, ‘being present’ can start to turn into hard work, or is perceived as a necessity to reach some kind of goal. At the end of the day it is all about feeling more at ease and aligned with your power, so go easy on yourself with it all. I've also noticed that alignment or presence can lead to a more creative and positive imagination. If this happens, embrace that too. Sometimes people think they should always have no thoughts, and they get stuck in resistance again.Also feel free to ignore what I've said if it doesn't resonate with you.\"Sometimes people can be holding up a measuring stick to assess \"how present\" they are being in the moment. But why? What is the point of being present anyway? Generally it is so that someone feels more at ease, or more aligned with their true mind, which is empowered rather than negative.A question you can ask yourself is: \"why am I trying to be present?\" The answer might be \"to feel free or at peace or at ease\". So, how would it feel if you were now free already? How would freedom feel? Sometimes this question can speed up your experience of freedom, if that is what you are seeking. Give the question some space. You don't have to jump in with an answer. Let it answer itself.I hope that can help. Feel free to let me know if it does or doesn't by commenting belowAll the very best,AdamInner Peace Now > Finding Inner Peace > Tips For Inner Peace and How To Stay Present"},{"Heading ":"Dealing With The Pain Body At Work","Context":"When my pain body tries to get a reaction and I don't respond, I then get this intense heat in the body and I sweat a lot.But I am now realising how odd it is, and I don't believe in it as much as I used to. Then I'm the observer of it. Then the heat\/sweating stops almost immediately.But what does it mean? To me, I think it's as if the pain body is trying whatever it can to get a \"explosive\" reaction and it's not.But, why intense heat????","Content":"Hello everyone,Here's a recent Q&A with someone who contacted me about experiencing the pain body (more on the pain body here). In this question the pain body manifests as intense heat, but it could manifest in someone else as any uncomfortable repetitive emotion or repetitive negative thoughts.Hi Adam,I haven't contacted you in some time and I hope you are well. When my pain body tries to get a reaction and I don't respond, I then get this intense heat in the body and I sweat a lot.But I am now realising how odd it is, and I don't believe in it as much as I used to. Then I'm the observer of it. Then the heat\/sweating stops almost immediately.But what does it mean? To me, I think it's as if the pain body is trying whatever it can to get an \"explosive\" reaction and it's not.But, why intense heat????It's draining and I started a new job recently. I'm really enjoying it. But dealing with my pain body is making me act in bizarre ways.Any advice you can give me would be much appreciated.Thank you.Hello,Hope you are well too.That's great that now you are noticing and taking it less seriously (or not giving it belief like you used to), it starts to stop immediately.Continue with the same approach and it will get easier and easier, and the pain energy will get weaker and weaker.Why heat? I can only guess that it is some form of resistance. Resistance in other forms (rubbing your hand against a desk, for example), will produce heat. I think it's just a form of resistance.I think that you are right - when you don't react, even more pain comes at first to try to drag you into a battle. Another way to look at it is old pain comes to the surface and is released. I think the way you are handling it is very effective. That's great you are enjoying your job. Let that be your main focus of your attention - the fact that you enjoy your job - and that will help diminish resistance without you directly trying.The only other thing I could suggest is to APPRECIATE moments of ease or calm. What you appreciate, appreciates, and your clarity will grow stronger by itself. This appreciation could be as simple as saying \"I love feeling calm and clear\", or \"I love feeling at ease\" - whenever you feel remotely calm or at ease.The more you notice and appreciate the calm moments - the stronger that energy grows in you, and it will make the pain energy even less believable if it ever returns.Focusing on or appreciating the good and calm moments really works wonders for dissolving background pain without any effort. One day you might be in a situation that was formally a trigger, and then you will notice that it no longer triggers your pain body anymore.Sounds like you are doing great.All the best,Adam"},{"Heading ":"The Secret Of Self Confidence","Context":"“The secret of self confidence isn't to stop caring about what people think - it's about caring about what YOU think. It's to make your opinion of yourself more important than anyone else's.”","Content":"I don’t know who originally said this quote. I have just seen it online without any credit given. If it was you who wrote this quote, or if you know who wrote it, please let me know so I can credit them.Then comes the task of working out what it is that YOU really think about something, rather than your own opinions and beliefs being a by-product of what you have learnt and heard from others during your life.One little exercise that might be helpful, if you are contemplating anything in particular, is to imagine that no one else's opinions exist for a moment. Imagine that no one else in the world could have an opinion about anything - so it is all up to you. Or you can imagine that you have just been born - so you are free and unconditioned and without any external knowledge of things. Then ask yourself within what YOU think about something - whether it's about yourself, a plan of action, a situation - ask yourself as if you are asking the intelligence deep within you - the intelligence of your soul, if you like. Then see what answers come.This can help you to become in tune with your own voice. Once you learn to give this voice space to be heard, and give it an importance over other voices around you or in your head, then you can start to experience what the quote above is referring to.I hope that helps. If you have any questions then let me know in the comments below.I wish you a wonderful week,Adam"},{"Heading ":"A Genius Mind","Context":"I came across this quote by Napoleon Hill recently and loved it, so thought I'd share. It's a reminder to not add any weight to any voices around you that try to bring you down or you feel hold you back in any way…","Content":"Hello everyone.I came across this quote recently and loved it, so thought I'd share. It's a reminder to not add any weight to any voices around you that try to bring you down or you feel hold you back in any way. Somewhere along the way people can learn that the external voices are more valid or important or more powerful than their own. They lose awareness of their own intelligence and their ability to create their own beliefs, rather than their beliefs being a by-product of their environment and the people around them.You don't have to put anyone else's thoughts or voice above your own. As long as you are not hurting anyone, you have the ability to be in charge of your own thoughts, and where your attention goes.Here is the quote, which of course applies to \"her\" as well as \"his\".If any of you or your kids are enjoying my martial arts adventure series with life lessons like the one above, \"A Tale Of Two Ninja Kids\", Book Seven was recently released. If you would like to order the book on Amazon, click here.Inner Peace Now > Blog > A Genius Mind"},{"Heading ":"New Book - \"A Tale Of Two Ninja Kids Book 7 - The Ninja Chronicles\"","Context":"The latest book in my popular “A Tale Of Two Ninja Kids” series is out now. This is a family-friendly martial arts adventure series for ages 7 and up…","Content":"For anyone who has been buying these books for themselves or their family - thank you. Book 7 is out now!📖Find out what happens when Myasako discovers the ancient book of ninja chronicles, where he learns from past masters and warriors that have lived through great adventures...Discover the truth about the Lightning Ninja and his anonymous good deeds.Meet Kuyasaki's master, Hirozama, as he is forced to take the ninja path at an early age.See how one girl breaks away from the norms of her society to follow her dreams and discover the true powers that lie within herself...Meet Henrik The Defender as a young boy, where he teams up with a ninja named Senyara and a dragon named Dengor to fight against an evil force in the forest.Discover what happens when young Senyara decides to steal from a creature that all others fear, and learn about the ways that true ninjas can develop their strength...The adventures of The Ninja Chronicles await.Delve in to them now...📖Click here to order on Amazon. I hope you enjoy it!AdamInner Peace Home > Inner Peace Blog"},{"Heading ":"How To Deal With Negative Thoughts","Context":"If you are dealing with any negative thought patterns, question whether or not they are serving you. What are they doing to help?","Content":"Hello everyone,\"Things wither and die through indifference. They are kept alive through attention.\" - Neville GoddardIf you are dealing with any negative thought patterns, question whether or not they are serving you. What are they doing to help?Often negative thought patterns can be assumed to be helping us on some level, but usually they aren't contributing to our wellbeing at all. In fact they are doing just the opposite.Habits of negative thought can often be like complaints to ourselves. There can be an assumption that the more we inwardly complain about something not being as we want it to be, the more likely we will be able to get what we want. This usually isn't very effective once the thoughts just start repeating themselves in the mind.Just noticing that negative thought patterns aren't serving to improve yourself or your life, can automatically mean you start to give them less importance. With less importance assigned to them, when you no longer assume they are helpful guides, their strength begins to diminish by itself.The same can be said for worry. If it is clearly seen that the thoughts of worry aren't helping you to produce a positive result, then naturally they start to weaken by themselves.Negative thoughts are never enemies, but once they take hold and just go on repeat in the mind - their value and usefulness should be questioned, and questioned with honest curiosity.Sometimes it can be surprising to discover that a certain way of thinking that you might have been living with for years, actually never helped you at all.I hope everyone has a good week.All the best,Adam OakleyInner Peace Now > Blog > How To Deal With Negative Thoughts"},{"Heading ":"How To Deal With Stress","Context":"Recently during a one-to-one session, someone asked me how to deal with stress. A technique came up that was quite effective, and I hope it can help anyone here who is dealing with anything similar…","Content":"Recently during a one-to-one session, someone asked me how to deal with stress. A technique came up that was quite effective, and I hope it can help anyone here who is dealing with anything similar.The first thing to mention (which was not mentioned during the one-to-one) is that it often helps to just write out your feelings. Write down what you are stressed or worried about. Sometimes we keep worries in our minds because we are afraid of forgetting about something that we think needs to be fixed. If you put it down on paper, you can rest assured that it is always there to be looked at again if needed. If you have the intention of feeling better - writing down any stresses or worries gives you permission to let them go, at least for a while.During the one-to-one call, I said to the person:“You know how stress feels. Now what is the opposite of stress, for you?“Feel for what the answer is in your body, as if you are asking the question within. Then see what the response is.”I was expecting the person to give a word like “ease” or “calm” or “joy”, but they didn’t. They just smiled and said it was a certain sensation. And they could feel it.This person felt “the opposite of stress” begin to grow in their system, and this lasted for about a minute.Then it stopped. Then the stress came back.So we repeated the process, in an easy, light way. “I know how stress feels. So what is the opposite of stress?”This time it didn’t work at all. The stress remained. The person told me they could no longer feel the “wonderful state” that they were beginning to feel before.Then I asked the question: “How would you feel if you could make the ‘wonderful state’ more important than the reasons to be stressed?”The person asked me to repeat this.“How would you feel if you could make the ‘wonderful state’ more important than the reasons to be stressed?”Then we started to see some good results. Things started to shift.Stresses and worries tend to take precedent over any calm or relaxed state, because they are responses to perceived dangers. The painful thoughts think that they are helping to resolve a situation and keep us safe. But we all know that whenever there is a truly challenging situation that arises, the person who is clear and calm is able to function most fluidly and clearly using their instinct. Even if they feel fear or stress, it is the one who is not completely taken over by these feelings who usually responds best to stressful situations. They are not fighting against themselves or their feelings, so they just respond if needed.Therefore it is useful to see where our allegiance lies. Where our faith lies, where our loyalty lies. If you use the process above, even for ten minutes, during that ten minutes it is helpful to decide that you will be completely faithful and loyal to the ‘wonderful state’, the opposite of stress, as if it is your chosen partner and you are in a committed relationship with it. If you are disloyal and cheat on the relaxed or wonderful state, then you will be mixing with denser energies, having mental relationships with thoughts that don’t actually serve you in the way they think they do in that moment.I’m not saying you have to walk around in this state all the time. You don’t have to do anything. But as a tool for relieving stress, if that is what you want, then I invite you to sit or lie down somewhere safe and comfortable, and go through the simple process above. I hope it helps.All the best,Adam OakleyInner Peace Home > Blog > How To Deal With Stress "},{"Heading ":"Freedom From Negative Thoughts","Context":"This week I thought I’d mention another way to deal with negative or intrusive thoughts.Treat them as if they are negative friends – people who mean well and want the best for you, but people who you would be wise to stay away from and not listen to…","Content":"Hello everyone,This week I thought I’d mention another way to deal with negative or intrusive thoughts.Treat them as if they are negative friends – people who mean well and want the best for you, but people who you would be wise to stay away from and not listen to.You can tell a voice of a negative friend because their words feel unpleasant to listen to. The same goes for negative thoughts. The discomfort of negative thoughts is a signal that they are not giving you any good advice, and it would be in your best interests not to take them seriously. They feel dark because they are thoughts that don’t come from your natural powerful light, and usually they have come through some sort of conditioning.Negative thoughts never have to be fought against, but it does help to recognise that these energies are not effective givers of advice. Just like the negative friend, they think they are saying what is best, but really they are not helping at all. If anything, they are doing the opposite of helping.Once a painful thought is recognised as not a useful helper, it can be allowed to pass through, or it can be disregarded as false, and replaced by any affirmative or powerful thought of your choosing.To create space for more powerful, abundant or creative thoughts, it can help to first open yourself up to the broadest, freest part of yourself. Ask yourself a question like: “If I knew I was one with the universe around me, how would I feel?”. This might help to create some space and take attention away from a mind that feels closed, small and cut-off from abundant power.I hope everyone has a great Christmas this year. The book I mentioned I was working on probably won’t be finished by the end of the year, but if anyone has children aged 7 or above, feel free to check out my full “A Tale Of Two Ninja Kids” series below. It’s a martial arts adventure series for the whole family, which brings in some of the deeper messages on how to deal with thoughts, emotions, and how to become more in alignment with who you truly are.Or for all of my inner peace books for kid and grown-ups, click here…All the best to everyone,Adam"},{"Heading ":"How To Deal With Negative Thoughts - The Power Of Indifference","Context":"People I speak with during one-to-ones are often thrown off by negative thoughts. They might be in a good place mentally, but a particular painful thought might keep coming back to nag them.One of the best solutions is indifference…","Content":"Hello everyone,I know it has been a while. I have been focused on some other things, including a new book that might be out by Christmas (for kids and grown-ups), and I haven't felt like creating any new posts.But now, I feel like saying this:People I speak with during one-to-ones are often thrown off by negative thoughts. They might be in a good place mentally, but a particular painful thought might keep coming back to nag them.One of the best solutions is indifference.If the negative thought pattern returns, it usually feels like a big deal. We are used to reacting against pain, it is natural to do so, so when a negative thought arises it can feel as if it messing up our inner world.But what if you were indifferent to thoughts that didn't feel good? What if negative voices didn’t mean anything to you? What if you were indifferent as to whether they were there or not?If you experiment with it, the indifference towards negative thoughts is quite powerful. It might not be an instant fix forever, but gradually, as negative thoughts come back and seem to want to cause a fuss, your lake of care towards them means they start to lose their disturbing power.Once they have arisen, you probably feel you can’t make them un-arise. But with a lack of interest, a lack of importance given to them, a total indifference to whether they are there or not, you might start to find your balance, and more freedom if there is anything positive you are looking to focus on, even if you want your focus to be on the simple sense of \"I Am\", being, an affirmation, or even your breath.You might notice that using this approach means thoughts in your head start to soften, and you might be left with an underlying uncomfortable emotion in your body. Treat that discomfort in the same way. Be indifferent as to whether it is there or not. And if you really want to transmute it faster, surround it with the unconditional energy of \"thank you\" within yourself.Experiment with indifference to negative thoughts. Give it a day, and see what happens.All the best,Adam"},{"Heading ":"Having Emotional Goals For Finding Happiness","Context":"Having a goal helps to focus your mind and energy. If we have an emotional goal, it makes us more aware of what we are thinking, how we are feeling, and it can sharpen our ability to let go of anything that keeps us from our goal. Having an emotional goal can make finding happiness easier…","Content":"Having a goal helps to focus your mind and energy. If we have an emotional goal, it makes us more aware of what we are thinking, how we are feeling, and it can sharpen our ability to let go of anything that keeps us from our goal.An emotional goal is not supposed to involve any struggle or time. It is just an intention, a certain focus to keep yourself in a certain energy, rather than letting yourself be carried away by the winds of negative thoughts or social conditioning.I hope this video on emotional goals helps:Inner Peace Now > Finding Happiness > Having Emotional Goals For Finding Happiness"},{"Heading ":"How To Deal With A Negative Mind And Negative Thoughts","Context":"I hope this article helps to give you a quick and easy method for how to deal with negative thoughts and a negative mind, allowing you to access a part of your mind that can actually give rise to positive and empowering thoughts.","Content":"Hello everyone,I hope this article helps to give you a quick and easy method for how to deal with negative thoughts and a negative mind, allowing you to access a part of your mind that can actually give rise to positive and empowering thoughts.During a recent one-to-one call with me, someone was mentioning that their mind would often become negative. Even if they were doing something creative that they enjoyed, their mind would come in with negative thoughts of:“You shouldn’t be wasting your time with this. You should be doing something more valuable that is more likely to bring you money.”The result was that this person was discouraged in their activity, and when they stopped, they didn’t do anything else constructive. That was it.A negative mind can of course come in all kinds of forms. It can appear as worrying about something, or being down on yourself about something.Negative thoughts tend to take hold on us because we subconsciously believe that they will help us in some way. Perhaps in our lives if we have been sad enough or upset enough, someone else has come and given us help, special attention, or changed their ways. For whatever reason, there is often an assumption in us that this negative voice in the head must in some way be valuable. Otherwise – why would it be there?We can unconsciously assume that perhaps the negative mind is helping us, keeping us safe, or keeping us disciplined or holding us accountable to mistakes we have made.But in the end, negativity tends to do one thing:Hold you back.So, instead of being in any kind of battle with a negative mind (as the person who I was speaking to was), instead you can try this:Ask the mind to ACTUALLY help you.It is as simple as stopping and saying: “Ok, mind, it seems you are trying to help me in some way with this kind of thinking. So help me then. ACTUALLY HELP ME. Help me with this subject. Help me to progress and move forward. Give me real help.”Then wait, and see what happens. Remain in this state of receptivity, asking for and expecting help.It is almost as if you are calling the negative mind’s bluff. It is a disruptive presence within you, acting as if it is helping, so you give it a chance to ACTUALLY HELP.During the one-to-one call with someone, when we did this, the first thought the person got was:“Focus on things that you like.”This was a different thought to the ones that she had recently been having. It was far more wise and positive.I asked her to remain in that same state, saying “Ok, thank you, anything else?”After a short while she began to receive other thoughts of herself in a much more pleasant state – relaxed, happy and less attached to negative thoughts. Considering that most of her recent thoughts were anxious ones, this was a step in the right direction.It can be as simple as this. To remain in this state. Actually following the wise advice that comes from within you is also of great benefit. What sometimes happens is someone receives some form of higher guidance, but soon enough they are back under the influence of a negative or fearful mind.The question the caller then asked me after seeing herself in a pleasant state, was:“So how do I get in that kind of state where I feel relaxed and happy?”My answer was:“You don’t have to do anything differently. Remain in that same receptive state. Say ‘thank you’ for these pleasant visions of yourself, and then say: ‘anything else?’ This pleasant state that you can start to see will build momentum and enter your system more fully if you simply remain receptive to it. You don’t have to “do” it or create it as a personal task. It is already there. Remain receptive to it.”And that’s it.I hope that if you are dealing with a negative mind that pretends or believes it is helping you – you can actually surrender and ask it for real help, and see what happens. Either the negative mind will become quiet as it has nothing of value to actually say, or you begin to access the truest part of your mind that is indeed, actually helpful.I hope this little practice is useful for you.If anyone would like help finding more of their inner peace in any part of their lives, you can click here to book a session with me. Here is a recent testimonial:I hope you have a great week.All the very best,Adam OakleyInner Peace Now > Finding Inner Peace > How To Deal With A Negative Mind And Negative Thoughts "},{"Heading ":"How To Make Forgiveness Easier","Context":"Forgiveness can be made easier through asking yourself the question:\"If I was able to forgive or let go of this - then how would I feel?\"If you ask the question and feel for the response, and repeat this inner experiment, eventually you might reach a point where you are experiencing the freedom of forgiveness, without ever making the step to forgive and let go.I hope this video helps in making forgiveness easier, which was taken from a one-to-one session with me.","Content":"Hello everyone,I hope you are all well. This week I thought I'd share something on forgiveness, and how to bypass a difficult process and instead go straight to the end result.Forgiveness can be made easier through asking yourself the question:\"If I was able to forgive or let go of this - then how would I feel?\"If you ask the question and feel for the response, and repeat this inner experiment, eventually you might reach a point where you are experiencing the freedom of forgiveness, without ever making the step to forgive and let go.I hope this video helps in making forgiveness easier, which was taken from a one-to-one session with me.Inner Peace Now > Finding Inner Peace > How To Make Forgiveness Easier"},{"Heading ":"A Tip To Quieten The Mind And Make Meditation Easier","Context":"Recently during a group Zoom call I began by talking about the attempt to quieten the mind, and how to make it easier.Trying to silence or calm the mind through force can create extra tension. If we realise that this calmness or quietness is all around us all the time, then it is easier for the noise to merge with that silence naturally. Below you can watch a short clip of me explaining this little tip that can make meditation easier. I hope it helps...","Content":"Recently during a group Zoom call I began by talking about the attempt to quieten the mind, and how to make it easier.Trying to silence or calm the mind through force can create extra tension. If we realise that this calmness or quietness is all around us all the time, then it is easier for the noise to merge with that silence naturally. Below you can watch a short clip of me explaining this little tip that can make meditation easier. I hope it helps...Inner Peace Now > Finding Inner Peace > A Tip To Quieten The Mind And Make Meditation Easier"},{"Heading ":"How To Deal With Dissatisfaction And How To Find Happiness - Inner Peace Now","Context":"During a recent group zoom call for inner peace, someone asked about dealing with a sense of dissatisfaction they were feeling in their life. Hopefully this simple approach can help in dealing with dissatisfaction and finding happiness…","Content":"During a recent group zoom call for inner peace, someone asked about dealing with a sense of dissatisfaction they were feeling in their life. Hopefully this simple approach can help in dealing with dissatisfaction and finding happiness.If someone knows what dissatisfaction feels like, then they could perhaps ask the question: “What does satisfaction feel like?”This person wanted to essentially get rid of the unpleasantness of feeling stuck in dissatisfaction. If that is your goal, then satisfaction should be entertained as an unconditional feeling, or an energy that always exists that doesn’t need a condition to trigger it within you.If you access satisfaction directly, without any external cause, you are home free.I hope the video helps…Inner Peace Now > Finding Happiness > How To Deal With Dissatisfaction and How To Find Happiness"},{"Heading ":"Wanting To Be Happy - Is It OK To Want Happiness?","Context":"During recent group Zoom meetings I have been asked if the desire for happiness or the desire to feel good implies resistance against negativity within ourselves.\"If I want to be happy, does that mean I am in resistance to unhappiness?\"I would say not necessarily. Happiness is a natural preference, in the same way that pleasant food is preferred over garbage. Once the fight against unhappiness or negativity starts to come to an end, there gradually becomes more space for us to choose a way to feel, if we want to do such a thing…","Content":"Hello everyone,I hope you are all well.During recent group Zoom meetings I have been asked if the desire for happiness or the desire to feel good implies resistance against negativity within ourselves.\"If I want to be happy, does that mean I am in resistance to unhappiness?\"I would say not necessarily. Happiness is a natural preference, in the same way that pleasant food is preferred over garbage. Once the fight against unhappiness or negativity starts to come to an end, there gradually becomes more space for us to choose a way to feel, if we want to do such a thing.I go into more detail in the video, a clip from a recent Zoom call.If you would like to join a future group Zoom meeting (even if you just want to listen in), click here.Inner Peace Now > Finding Happiness > Is It OK To Want Happiness?"},{"Heading ":"How To Deal With Jealousy","Context":"Hello everyone,Recently during a one-to-one session I was speaking with someone about jealousy and the reason for it.Jealousy is usually an ineffective attempt to get what we want. If someone has something that we want, but we think we don't have it, the jealous feeling can be an inner objection, like a child becoming upset if it doesn't get its own way, demanding that things change for the better.","Content":"Hello everyone,Recently during a one-to-one session I was speaking with someone about jealousy and the reason for it.Jealousy is usually an ineffective attempt to get what we want. If someone has something that we want, but we think we don't have it, the jealous feeling can be an inner objection, like a child becoming upset if it doesn't get its own way, demanding that things change for the better.But the jealous feeling does not help to shift the universe to accommodate you further in your desire. It has the opposite effect. It closes down your energy and makes you shift towards an inner feeling of \"no\" towards success, love, riches or anything else that you want. It is essentially resistance towards what you actually want.The alternative approach is to re-train yourself to start to bless what you want when you see it. If someone is living in the conditions that you would like to live in, see if you can start to appreciate the abundance of it instead of condemning it in any way. This might seem difficult at first if jealousy has any past momentum for you, but it is easier if you take the approach of wanting to feel as good as you possibly can.Seeing someone get what they want in life can be met with a genuine feeling of \"Wow. That's great.\" If you actually like to see success in any form around you, if you start to appreciate it and love it, your energy starts to shift so that you are in alignment with it yourself. You can tell this is happening because you start to feel better.Just because someone has something great doesn't mean you can't experience great things too. You might find that the more you bless it with appreciation when you see it, the more you start to experience it for yourself.In a recent Group Zoom Meeting, someone asked about the feeling of jealousy in relationships - particularly to do with the jealousy she would feel if other women were approaching her partner. I'll share my video response to this soon.If you want to join any of the future free group Zoom meetings, just click here.If you would like more help dealing with specific emotions, check out my book:All the best,Adam"},{"Heading ":"The Practicality Of Feeling Good And Happy","Context":"If we are actually choosing to feel good or happy instead of feeling negative in any way, are we not resisting the negativity in order to feel better? Is there not some kind of conflict within us if we want or choose to feel happy?","Content":"During Group Zoom Meetings the question has come up a few times:If we are actually choosing to feel good or happy instead of feeling negative in any way, are we not resisting the negativity in order to feel better? Is there not some kind of conflict within us if we want or choose to feel happy?At first, when there is a lot of habitual negativity or resistance in the system, the natural desire for happiness is combined with a sense of pushing against the feelings we don’t want. The desire to feel good is a natural preference that leans in the direction of alignment and a sense of oneness with your own power, but negativity does not need to be resisted to go with it.Gradually as you end the war with yourself, as you stop fighting or condemning yourself or your feelings in any way, there can be a natural space that allows for the question:“How does happiness feel?”The less resistance there is in the mind, the easier it is for this question and its answer to be allowed. The mind can sometimes be quick to give you reasons to remain in tension or negativity or worry, and the above question can quickly feel uncomfortable. Treat it like a game. It can be a process.I will share more on this later. In a recent Zoom call someone shared that they were realising that it is okay to feel good, that there is nothing wrong with it. Then I shared a few thoughts which you can watch in a quick video below.If you would like to join the next group Zoom meeting, you are welcome…Inner Peace Now > Finding Happiness > The Practicality Of Feeling Good"},{"Heading ":"How To Move Out Of Negative Self-Stories | How To Feel More Secure | How To Feel More Inner Peace","Context":"During a recent group Zoom meeting for inner peace, someone began asking about how to move out of negative self-stories. This led to a response about the mind ultimately seeking some sense of existence or security, and how this sense of security could be accessed directly in a much more enjoyable way. Then there is a segment about inner peace - how you can treat it as an infinite and abundant energy that is constantly around you and flowing through you, and you are either noticing it, or not...","Content":"During a recent group Zoom meeting for inner peace, someone began asking about how to move out of negative self-stories. This led to a response about the mind ultimately seeking some sense of existence or security, and how this sense of security could be accessed directly in a much more enjoyable way. Then there is a segment about inner peace - how you can treat it as an infinite and abundant energy that is constantly around you and flowing through you, and you are either noticing it, or not...I hope this video has been helpful for you.All the best,Adam OakleyHome > Blog > How To Move Out Of Negative Self-Stories | How To Feel More Secure | How To Feel More Inner Peace"},{"Heading ":"Wanting To Be Happy","Context":"The desire to feel good - is it wrong?Something that came up in a recent group Zoom meeting…The desire to feel good or experience happiness - does this mean we are resisting ourselves being in a state of non-happiness?","Content":"Something that came up in a recent group Zoom meeting…The desire to feel good or experience happiness - does this mean we are resisting ourselves being in a state of non-happiness?Not necessarily. The pure desire itself contains no resistance. It is like being offered a plate of garbage or a plate of your favourite food. You have the option to choose what you want without pushing against what you don't want. You have a natural preference for something that is in alignment with who you are.Often when people are experiencing negative emotions, there can be so much resistance and a sense of \"not being in control\", that the desire to feel better can create even more of a pushing against yourself and not allowing yourself to be as you are.At a certain point, if you are no longer judging or condemning yourself for feeling less than good, then gradually resistance begins to ease. When there is less resistance, it is more easy to allow yourself to be tuned to a sense of well-being, wholeness, satisfaction or happiness, as if you are choosing, inviting, or making friends with that energy within you.Usually our natural desire for happiness becomes outweighed by our desire for other things. Feeling good is often taught as complacency or irresponsibility, as if you must put your inner well being on hold before everything is as you want it to be.When the desire to be in alignment or to feel good becomes more important than everything else being perfect, then it will begin to build a momentum of its own and become more and more pure. If it becomes consistent, it begins to influence your world for the better.If you would like to attend the next group Zoom meeting (you can just listen in if you don’t want to participate), just fill out the form below…Date: Sunday 25th AprilTime: 4pm UK Time \/ 11am Eastern \/ 10am Central \/ 8am PacificDuration: Approx 40 mins"},{"Heading ":"The Mantra Of \"Thank You\"","Context":"Try this little exercise of “thank you” to train your mind away from negative thoughts…","Content":"Hello everyone,I enjoyed the Zoom call last week with those of you who attended. It was great to see you and to answer some of your questions.I will continue with the meetings at a similar time, but probably once every three weeks.Next week is Easter, so I will schedule the next meeting for 11th April. I will send out an invitation nearer the time, and rather than charging a set fee, I will include a donation link. Then if you want to support me and have some kind of exchange then that is great (with an amount that feels good to you, rather than an amount that you think you should give). But for those that don’t want to donate, the meeting is still open to you.A key point from last week’s meeting:A feeling of uneasiness or even a sense of doom around life is a defence mechanism conditioned by your past. It is like a crazy well-meaning friend who tries to convince you that if you remain focused on things you don’t want, then you will have a better chance of avoiding them.Unfortunately the crazy friend doesn’t realise that the more your energy is focused on unwanted things or a lack of what you want - the more effective you become at noticing and even attracting more of these things. Think of yourself as an energy being. Your energy affects your surroundings. If this is the case, the negative energy (even if it thinks it is helping you to protect yourself), actually keeps you stuck in an energy and a reality that you don’t want to be in.Thank the crazy friend for trying, but realise there is a craziness to it. If you can go as far as to thank it for trying to help, the more easily it is to feel the vibration of “thank you” in your body.Try saying “thank you” for absolutely no reason and to no one, but within yourself, for just a few minutes.If you play that game, you will build a power of focus and begin to re-shift your energy to a place where negativity no longer likes to be. If it returns, it is weaker, and simply acts as a reminder that you are not fully aligned with who you are. It just signals that you are in fear instead of power.The crazy friend actually starts to become helpful –  he warns you when you are out of alignment, when you have strayed away from the natural good energy that is within you, that you may need to practice re-orientating yourself with.We are usually trained away from our own alignment and wellbeing. Our upbringing can be more about lack and fear than anything else, and so we start to think that these mental and emotional states are normal and necessary to survive. Start to play the game of re-orientation, the inner mantra of “thank you” for just a few minutes, until it builds its own momentum, and starts to take over the momentum of past painful thinking.Gradually the words of “thank you” become a feeling, and then the feeling is recognised as a frequency of energy or state of being that is very much in alignment with your natural positive power. It is much more orientated with a sense of abundance.Hopefully that can help for now. Here are the details of the next Zoom meeting (an hour earlier for some of you since the clocks have just moved forward here in the UK):Date: Sunday 25th AprilTime:  4pm UK Time            11am Eastern Time (EDT) If you attended the last meeting – you don’t have to do anything – I will send you another invitation. If more of you would like to attend the next meeting, just fill in the quick form below and I will send you an invitation before the meeting. All the best, Adam"}]